Revit 2026 API

# BuiltInFailuresFloorFailures Class

---

Failures related to floors and slabs.

SystemObject Autodesk.Revit.DBBuiltInFailuresFloorFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FloorFailures
```
```vb
Public NotInheritable Class FloorFailures
```
```cpp
public ref class FloorFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FloorFailures = class end
```

The BuiltInFailuresFloorFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FloorSlopeExceedsThreshold | Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties. |

#### Reference

Autodesk.Revit.DB Namespace